/*****************************
* AUTHOR: Elyasaf Cohen      *
* ID:     311557227          *
* SUBJECT: Targil 8          *
* Seif: I                    *
******************************/
#pragma once
#include<iostream>
using namespace std;
///------------------------------------------------ List אנחנו בקובץ ההדר של -----------------------------------------------------///

//------------------------------------------\\
//  class List                              \\
//      arbitrary size Lists                \\
//      permits insertion and removal       \\
//      only from the front of the List     \\
//------------------------------------------\\


//------------------------- List פתיחת המחלקה --------------------------//
class List {

protected:

	//--------------------------------------------\\
	//  inner class link                          \\
	//  a single element for the linked List      \\
	//--------------------------------------------\\

	//------------ Link פתיחת המחלקה המוכלת הפנימית --------------//
	class Link {

		//---- Link תהיה גישה ישירה לשדות של List-כדי של public - מגדירים כ-----//
	public:

		//-------- קונסטרקטור -------//
		Link(int linkValue, Link* nextPtr);
		//----- קופי קונסטרקטור -----//
		Link(const Link&);


		//-------- השדות -------//
		int value; // key - ערך ה
		Link* next; //הפונייטר לצומת הבאה

	};


public:
	//-------- קונסטרקטור --------//
	List();
	//----- קופי קונסטרקטור -----//
	List(const List&);
	//-------- דיסטרקטור --------//
	~List();



	//---------- הוספת איבר חדש לרשימה -----------//
	void add(int value);
	//----- של החוליה הראשונה key החזרת ה -------//
	int firstElement() const;
	//----------- חיפוש נתון ברשימה -------------//
	bool search(const int& value) const;
	//---------- בדיקה אם הרשימה ריקה -----------//
	bool isEmpty() const;
	//------- מחיקת האיבר הראשון ברשימה ---------//
	void removeFirst();
	//------------ מחיקת כל הרשימה --------------//
	void clear();



	//---------------------- = אופרטור שווה -------------------------//
	List operator=(const List my_list);
	//-------------------- << פונקציה חברה - אופרטור פלט -----------------------//
	friend ostream& operator<<(ostream& lout, const List& my_list);
	//-------------------- >> פונקציה חברה - אופרטור קלט -----------------------//
	friend istream& operator>>(istream& lin, List& my_list);
	//-------------------- מתודת הכנסה --------------------//
	List insert(int key);
	//-------------------- מתודת מחיקה --------------------//
	List remove(int key);



protected:

	Link* head; // מצביע לצומת הראשון

};