/*****************************
* AUTHOR: Elyasaf Cohen      *
* ID:     311557227          *
* SUBJECT: Targil 7          *
*                            *
******************************/
#pragma once
#include "Shape.h"
#include <iostream>
using namespace std;
///--------------------------------------------- Triangel אנחנו בקובץ ההדר של -----------------------------------------------///


//--------------------------- Triangel פתיחת מחלקת הבן  ----------------------------//
class Triangel : public Shape { // Shape - יורשת מ Triangel המחלקה

/*
	אנחנו לא מגדירים שדות מכיוון שאנחנו יורשים מהאב
	 מס קודקודים ולכן עצם הירושה סוגרת לנו את הפינה
	הזאת וכל מה שנשאר זה פשוט להגדיר בקונסטרקטור של
						   האב את מספר הנקודות שיש לי
*/

public:

	//--- default-constructor ----//
	Triangel();


	//--------------------- המתודות הוירטואליות הטהורות של האבא --------------------------//

	//---------------- חישוב שטח ----------------//
	virtual float area()const override;
	//------------- בדיקת תכונה מיוחדת -------------//
	virtual bool isSpecial()const override;
	//------------- הדפסת התכונה מיוחדת -------------//
	virtual void printSpecial()const override;
};