/*****************************
* AUTHOR: Elyasaf Cohen      *
* ID:     311557227          *
* SUBJECT: Targil 6          *
* Seif: II                   *
******************************/
#pragma once
#include "List.h"
#include<iostream>
using namespace std;

///------------------------------------------------ RoundList אנחנו כרגע בקובץ ההדר של -----------------------------------------------------///


//------------------------- RoundList פתיחת מחלקת הבן --------------------------//
class RoundList : public List { // List - יורשת מ RoundList המחלקה 

public:

	//-------- קונסטרקטור --------//
	RoundList();
	//----- קופי קונסטרקטור -----//
	RoundList(const RoundList&);
	//-------- דיסטרקטור --------//
	~RoundList();


	//--------------- הוספת איבר בראש הרשימה ---------------//
	void addToEnd(int val);
	//---- n והחזרת ערך האיבר הנמצא במקום n חיפוש ברשימה את האיבר ---//
	int search(int n);

	

	//---------------- הוספת איבר חדש לרשימה -----------------//
	void add(int val);
	//----------------- חיפוש נתון ברשימה -------------------//
	bool search(const int& val) const;
	//------- מחיקת האיבר הראשון ברשימה ---------//
	void removeFirst();
	//------------ מחיקת כל הרשימה --------------//
	void clear();



	//---------------------- = אופרטור שווה -------------------------//
	RoundList operator=(const RoundList my_list);
	//-------------------- << פונקציה חברה - אופרטור פלט -----------------------//
	friend ostream& operator<<(ostream& lout, const RoundList& my_list);
	//-------------------- >> פונקציה חברה - אופרטור קלט -----------------------//
	friend istream& operator>>(istream& lin, RoundList& my_list);
	//-------------------- מתודת הכנסה --------------------//
	List insert(int key);
	//-------------------- מתודת מחיקה --------------------//
	List remove(int key);


};