/*****************************
* AUTHOR: Elyasaf Cohen      *
* ID:     311557227          *
* SUBJECT: Targil 8          *
* Seif: II                   *
******************************/
#pragma once
#include<iostream>
using namespace std;
///------------------------------------------------ Stack אנחנו בקובץ ההדר של -----------------------------------------------------///


//------------------------- Stack פתיחת המחלקה האבסטרקטית --------------------------//
class Stack {

public:

	//----------- מחיקת המחסנית ----------------//
	virtual void clear() = 0;
	//------- בדיקה אם המחסנית ריקה -----------//
	virtual bool isEmpty() const = 0;
	//--------- הוצאה מהמחסנית ---------------//
	virtual int pop() = 0;
	//----------- דחיפה למחסנית --------------//
	virtual void push(int value) = 0;
	//-------- הצצה לראש המחסנית ------------//
	virtual int top() const = 0;

};